import java.util.LinkedList;

public class LinkedListLearn {
	static void main(String[] args) {
		LinkedList<Integer> nums = new LinkedList<>();
		
		nums.add(10);
		nums.add(20);
		nums.addFirst(5);   // [5, 10, 20]
		nums.addLast(30);   // [5, 10, 20, 30]
		
		nums.remove(1);     // удаляем 10 → [5, 20, 30]
		
		System.out.println(nums); // [5, 20, 30]
	}
}

// LinkedList — связный список.
// Хранит элементы как цепочку:
// каждый элемент знает предыдущий и следующий.

//📌 Когда использовать LinkedList?
// когда много вставок/удалений В СЕРЕДИНЕ списка
// когда работаешь как с очередью (queue)
// когда работаешь как со стеком